emacs.org
# -*- Mode: Org-Mode; -*-
#
# emacs.org --- André Beyer <beyeran@gmail.com>
# Time-stamp: <2013-03-28 15:04:57 beyeran>
#
#+STARTUP: indent
#+STARTUP: hidestars

* Essentials
** Macros
#+begin_src emacs-lisp :tangle emacs.el
;;
;; file: emacs.el
;;

(defmacro sys-diversification (gnu/linux &optional darwin win)
  "System diversification for Linux, Mac and Windows, focus on Linux"
  `(cond ((sys-type 'darwin) ,darwin)
         ((sys-type 'gnu/linux) ,gnu/linux)
         ((sys-type 'windows-nt) ,win)
         (t nil)))

(defun sys-type (name)
  (if (eq system-type name)
      t
    nil))

(defmacro multiple-global-set-key (key-pairs)
  "Setting multiple global key at once, e.g.:
       (multiple-key-set ((\"\\C-cx\" first-global)
	                      (\"\\M-ax\" second-global)))"
  `(progn
	 ,@(loop for item in key-pairs
			 collect `(global-set-key ,(first item)
									  ',(second item)))))

(defmacro require-beyeran (name)
  "Macro for loading special beyeran extensions"
  (let ((require-symbol (intern (concat "beyeran-" name))))
    `(require ',require-symbol)))

(defmacro multiple-add-to-hook (hook forms)
  "Setting multiple variables/functions to a mode-hook, e.g.:
       (multiple-add-to-hook haskell-mode-hook ('turn-on-haskell-doc
                                                'turn-on-haskell-mode))"
  `(progn
     ,@(loop for item in forms
             collect `(add-hook ',hook ,item))))

(defun flatten (x)
  (cond ((null x) nil)
        ((listp x) (append (flatten (car x))
                           (flatten (cdr x))))
        (t (list x))))
#+end_src
** Init File
#+begin_src emacs-lisp :tangle emacs.el

;; possible differences between paths
(setq explicit-shell-file-name "/bin/zsh"
	  shell-file-name "zsh"

	  dotfiles-dir (file-name-directory
					(or (buffer-file-name) load-file-name))
	  beyeran-dir (concat dotfiles-dir "beyeran/")
	  extensions-dir (concat dotfiles-dir "extensions/")
	  color-theme-dir (concat dotfiles-dir "custom-color-themes/")
	  beyeran-color-theme-dir (concat color-theme-dir "beyeran/"))

(defun add-to-loadpath (name)
  (add-to-list 'load-path (concat extensions-dir name)))

(add-to-list 'load-path dotfiles-dir)
(add-to-list 'load-path beyeran-dir)
(add-to-list 'load-path extensions-dir)

(add-to-list 'custom-theme-load-path beyeran-color-theme-dir)

#+end_src
** Loading Paths
#+begin_src emacs-lisp :tangle emacs.el

(defun load-multiple (folder-list)
  (mapcar #'(lambda (n)
              (add-to-loadpath n)) folder-list))

(setq *extension-list* '("color-theme" 
						   "paredit"
						   "org-mode"
						   "org-mode/lisp"
						   "ido"
                           "rainbow"
						   "ruby-mode"
						   "haskell-mode"
						   "haskell-indent"
						   "clojure-mode"
						   "swank-clojure"
						   "prolog"
						   "scheme"
						   "scss-mode"
						   "smex"
						   "ess"
						   "ess/lisp"
						   "coffee-mode"
						   "shen-mode"
						   "maxima"
                           "stumpwm"
						   "java"))

(sys-diversification
 (append *extension-list* '("/usr/share/emacs/site-lisp/slime/")))

(load-multiple *extension-list*)
#+end_src
** Requirements

#+begin_src emacs-lisp :tangle emacs.el
;; requiring local files

(require-beyeran "misc")
(require-beyeran "auto-insert")
(require-beyeran "paredit")
(require-beyeran "smex")
(require-beyeran "org")
(require-beyeran "org-babel")
(require-beyeran "org-export-templates")
;;(require-beyeran "jekyll")
(require-beyeran "ruby-mode")
(require-beyeran "haskell-mode")
(require-beyeran "clojure-mode")
(require-beyeran "prolog-mode")
;(require-beyeran "shen-mode")
;(require-beyeran "scheme-mode")
;(require-beyeran "scss-mode")
;(require-beyeran "coffee-mode")
;(require-beyeran "ess")
;(require-beyeran "zettel")
(require-beyeran "gtd")
;(require-beyeran "maxima")
;(require-beyeran "java")
(require-beyeran "octave")
;;(require-beyeran "erlang-mode")
(require-beyeran "slime")
(require-beyeran "rainbow")
(require-beyeran "stumpwm")

#+end_src

* General Stuff
** General (font, etc.)
  In here there is some general stuff which means: some settings
  (tool-bar, curser etc).

#+begin_src emacs-lisp :tangle beyeran/beyeran-misc.el
;;
;; file: beyeran-misc.el
;;

;;;;;;;; general stuff ;;;;;;;
(require 'cl)

(tool-bar-mode 0)
(menu-bar-mode 0)
(scroll-bar-mode 0)
(show-paren-mode 1)
(fringe-mode 0)
(setq-default tab-width 4)

(setq linum-format "%d "
	  global-linum-mode t
	  linum-disabled-modes-list '(eshell-mode wl-summary-mode compilation-mode)
	      inhibit-spalsh-screen nil
		  completion-cycle-threshold 5
		  indent-tabs-mode nil)

    (defun linum-on ()
	  "The overwritten function from linum.el to have some modes disabled"
	  (unless (or (minibufferp) (member major-mode linum-disabled-modes-list)) 
		(linum-mode 1)))

;; Alt as Meta for Mac (german keyboard layout fix)
(defun alt-as-meta-for-mac ()
  (setq mac-command-modifier 'meta
    mac-option-modifier 'none
    default-input-method "MacOSX"))

(sys-diversification
 ()
 (alt-as-meta-for-mac))

#+end_src

** Color Theme
#+begin_src emacs-lisp :tangle beyeran/beyeran-misc.el
;; color theme

(load-theme 'crshd2 t)
;; (load-theme 'erosion t)

#+end_src

** Cursor
#+begin_src emacs-lisp :tangle beyeran/beyeran-misc.el
;;;; cursor ;;;;
(setq-default cursor-type 'box)
(setq messages-buffer-max-lines 400
      blink-cursor-delay 0.2
          blink-cursor-interval 0.3)
#+end_src

** Comments and Timestamps
#+begin_src emacs-lisp :tangle beyeran/beyeran-misc.el
;;;; comments ;;;;
(setf comment-style 'indent)

(add-hook 'emacs-lisp-mode-hook #'imenu-add-menubar-index)
(global-set-key [mouse-3] 'mouse-popup-menubar-stuff)

;;;; time ;;;;
(display-time)
(setf display-time-day-and-date nil)
(setf display-time-24hr-format t)

;;;; timestamp ;;;;
(defvar iso-date-format "%Y-%m-%dT%H:%M:%S:z"
  "Format string for ISO dates.")

(defun iso-timestamp (&optional time)
  (format-time-sting iso-date-format
		     (or time (current-time))))

(defun insert-iso-timestamp ()
  (interactive)
  (insert (iso-timestamp)))

(defun iso-timestamp-sexp (&optional time)
  (parse-time-string (iso-timestamp)))

(require 'time-stamp)
(add-hook 'before-save-hook 'time-stamp)
(setf time-stamp-active t)
#+end_src

** Misc Functions
*** Lorem
   Webdesign is a kind of a hobby for me so I often encounter
   situations where I need to use text columns for veryfing my layout
   settings. The commonly used "lorem ipsum" seems like a standart
   text to do that, here's a function which generates it:

#+begin_src emacs-lisp :tangle beyeran/beyeran-misc.el
(defun lorem ()
  "Insert a lorem ipsum."
  (interactive)
  (insert "Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do "
          "eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim"
          "ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut "
          "aliquip ex ea commodo consequat. Duis aute irure dolor in "
          "reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla "
          "pariatur. Excepteur sint occaecat cupidatat non proident, sunt in "
          "culpa qui officia deserunt mollit anim id est laborum."))
#+end_src
*** html umlaute
#+begin_src emacs-lisp :tangle beyeran/beyeran-misc.el
;;;; Custom Functions ;;;;
(defun html-umlaute ()
  "replaces iso-umlaute with html-umlaute"
  (interactive)
  (let ((case-fold-search nil))
    (save-excursion
      (goto-char (point-min))
      (while (re-search-forward
              (mapconcat '(lambda (x) (car x)) *html-entities* "\\|")
              nil t)
        (replace-match (cdr (assoc (match-string 0) *html-entities*)))))))

;;;; Variables ;;;;
(setf *html-entities*
  '(("Ä" . "&Auml;")
    ("ä" . "&auml;")
    ("Ö" . "&Ouml;")
    ("ö" . "&ouml;")
    ("Ü" . "&Uuml;")
    ("ü" . "&Uuml;")
    ("ß" . "&szling;")))
#+end_src
*** massive-shrink
#+begin_src emacs-lisp :tangle beyeran/beyeran-misc.el
(defmacro defshrink (system space)
  `(defun ,system ()
     (interactive)
     (shrink-window ,space)))

(defshrink massive-shrink-darwin 20)
(defshrink massive-shrink-linux 14)
(defshrink massive-shrink-win 25)

(global-set-key (kbd "C-x C-q")
                (sys-diversification
                 'massive-shrink-linux
                 'massive-shrink-darwin))

#+end_src
*** make header (filestamp)
#+begin_src emacs-lisp :tangle beyeran/beyeran-misc.el
(setq *filestamp-seperator* "-")
(setq *filestamp-seperator-repetition* 46)

(setq *filestamp-user-name* "André Beyer")
(setq *filestamp-user-email* "beyeran at gmail.com")

(defun filestamp-make-seperator (times)
  (if (= 0 times)
      ""
    (concat *filestamp-seperator* (filestamp-make-seperator (- times 1)))))

(setq *filestamp-seperator-builded* (filestamp-make-seperator *filestamp-seperator-repetition*))

(defun filestamp-header-finished (comment-sign)
  (concat comment-sign *filestamp-seperator-builded* "\n"
          comment-sign " file: " "\n"
          comment-sign " " *filestamp-user-name* " <" *filestamp-user-email* ">" "\n"
          comment-sign " Time-stamp: <>" "\n"
          comment-sign *filestamp-seperator-builded* "\n"))

(setq filestamp-auto-insert-alist '((("\\.\\(tex\\|sty\\|cls\\)\\'" . "LaTeX Comment") .
                                     (insert (filestamp-header-finished "%")))
                                    (("\\.\\(lisp\\|lsp\\|cl\\)\\'" . "Lisp Comment") .
                                     (insert (filestamp-header-finished ";;")))
                                    (("\\.\\(hs\\)\\'" . "Haskell Comment") .
                                     (insert (filestamp-header-finished "--")))
                                    (("\\.\\(rb\\|irb\\)\\'" . "Ruby Comment") .
                                     (insert (filestamp-header-finished "##")))
                                    (("\\.\\(sh\\|zsh\\)\\'" . "Shell Comment") .
                                     (insert (filestamp-header-finished "##")))))

(defun filestamp-insert ()
  (interactive)
  (insert (filestamp-header-finished ";;")))

(add-hook 'write-file-hooks 'time-stamp)
(add-hook 'find-file-hooks 'auto-insert)
#+end_src

#+begin_src emacs-lisp :tangle beyeran/beyeran-misc.el
(provide 'beyeran-misc)
#+end_src
** Paredit
#+begin_src emacs-lisp :tangle beyeran/beyeran-paredit.el
;;
;; file: beyeran-paredit.el
;;

;;;;;;;; paredit ;;;;;;;;
(require 'paredit)

(when (require 'paredit "paredit" t)
  (mapc (lambda (hook) (add-hook hook (lambda () (paredit-mode 1))))
        '(emacs-lisp-mode-hook
          lisp-mode-hook
          slime-repl-mode-hook
          slime-mode-hook
          inferior-qi-mode-hook
          qi-mode-hook
          scheme-mode
          clojure-mode-hook)))
#+end_src

#+begin_src emacs-lisp :tangle beyeran/beyeran-paredit.el
(provide 'beyeran-paredit)
#+end_src
** smex
#+begin_src emacs-list :tangle beyeran/beyeran-smex.el
;;
;; file: beyeran-smex.el
;;

(and (require 'ido "ido" t)
     (ido-mode t)
     (require 'smex "smex" t)
     (smex-initialize)
     (setq smex-save-file "~/.smex")
     (smex-auto-update))

(provide 'beyeran-smex)
#+end_src
** rainbow
#+begin_src emacs-lisp :tangle beyeran/beyeran-rainbow.el
(require 'rainbow-mode)

(provide 'beyeran-rainbow)
#+end_src
** stumpwm
#+begin_src emacs-lisp :tangle beyeran/beyeran-stumpwm.el
(require 'stumpwm-mode)

(provide 'beyeran-stumpwm)
#+end_src
** auto-insert
#+begin_src emacs-lisp :tangle beyeran/beyeran-auto-insert.el
;;
;; file: beyeran-auto-insert.el
;;

(require 'autoinsert)

(auto-insert-mode)
(setq auto-insert-query nil
      auto-insert-directory (expand-file-name "~/.emacs.d/auto-complete/"))

(add-hook 'find-file-hooks 'auto-insert)

(setq auto-insert-alist
      '(("\\.lisp$" . ["insert.lisp" auto-update-file])
        ("\\.rb$" . [ "ruby.rb" auto-update-file ])))


(defun insert-today ()
  "Insert today's date into buffer"
  (interactive)
  (insert (format-time-string "%A, %B %e %Y" (current-time))))

(defun auto-update-file ()
  (save-excursion
	;; Replace @@@ with file name
	(while (search-forward "@@@" nil t)
	  (save-restriction
	    (narrow-to-region (match-beginning 0) (match-end 0))
	    (replace-match (file-name-nondirectory buffer-file-name))))))

(define-auto-insert "\.rb" "ruby.rb")

(provide 'beyeran-auto-insert)
#+end_src

* Org-Mode
** generall settings
#+begin_src emacs-lisp :tangle beyeran/beyeran-org.el
;;
;; file: beyeran-org.el
;;

(require 'org)

(add-to-list 'auto-mode-alist '("\\.org$" . org-mode))

(setq org-log-done t
      org-support-shift-select t
          org-src-fontify-natively t
          org-export-with-section-numbers nil)

;; overwriting some org functions
(defun org-cycle-global ()
  (interactive)
  (org-cycle t))

(defun org-cycle-local ()
  (interactive)
  (save-excursion
    (move-beginning-of-line nil)
    (org-cycle)))

(provide 'beyeran-org)

#+end_src
