emacs.org
** GTD

General Workflow:
=================

With the combination C-M-r a new buffer opens from where with 't'
or with 'n' new tasks or notes can be captured. The captured Tasks
will be stored in the todo.org file and notes will be stored in the
notes.org file.

All tasks are then gathered under the headline "Task" in the file.
Next step is to schedule these task. This is done by going over the
todo item and then hit C-c C-s. After scheduling the tasks surely
need to be refilled. Refilling means, that items are sorted from
the headline Task, to other headlines (which represent projects). 
This done with C-c C-w.

After scheduling the agenda can be viewed with the "org-agenda"
function. For a short reminder a workflow is sketched in the
following. There, the order is to be thought of chronologically
(1 begins in the morning and 4 ends in the evening).


Workflow:
---------
    1. Take tasks which come to mind
    2. work on already scheduled tasks
    3. review done tasks
    4. refill captured tasks


#+begin_src emacs-lisp :tangle beyeran/beyeran-gtd.el
;;
;; ----[ GTD ]----
;;
;; file: beyeran-gtd.el
;;
;; This is a day planer adaption seen on:
;; http://newartisans.com/2007/08/using-org-mode-as-a-day-planner/
;;

(define-prefix-command 'org-todo-state-map)
	 
(define-key org-mode-map "\C-cx" 'org-todo-state-map)
(define-key org-todo-state-map "x"
  #'(lambda nil (interactive) (org-todo "CANCELLED")))
(define-key org-todo-state-map "d"
  #'(lambda nil (interactive) (org-todo "DONE")))
(define-key org-todo-state-map "f"
  #'(lambda nil (interactive) (org-todo "DEFERRED")))
(define-key org-todo-state-map "w"
  #'(lambda nil (interactive) (org-todo "WAITING")))

(require 'remember)

(add-hook 'remember-mode-hook 'org-remember-apply-template)

(define-key global-map [(control meta ?r)] 'remember)

(sys-diversification
 (custom-set-variables
  '(org-agenda-files (quote ("~/projects/gtd/todo.org")))
  '(org-default-note-file "~/projects/gtd/notes.org" ))
 (custom-set-variables
  '(org-agenda-files (quote ("~/Projects/gtd/todo.org")))
  '(org-default-note-file "~/Projects/gtd/notes.org" )))

(sys-diversification
 (setq org-remember-templates
	   '((116 "* TODO %?\n   %u" "~/projects/gtd/todo.org" "Tasks")
		 (110 "* %u %?" "~/projects/gtd/notes.org" "Notes")))
 (setq org-remember-templates
	   '((116 "* TODO %?\n   %u" "~/Projects/gtd/todo.org" "Tasks")
		 (110 "* %u %?" "~/Projects/gtd/notes.org" "Notes"))))

(custom-set-variables
 '(org-agenda-ndays 7)
 '(org-deadline-warning-days 14)
 '(org-agenda-show-all-dates t)
 '(org-agenda-skip-deadline-if-done t)
 '(org-agenda-skip-scheduled-if-done t)
 '(org-agenda-start-on-weekday nil)
 '(org-reverse-note-order t)
 '(org-fast-tag-selection-single-key (quote expert))

 '(org-agenda-custom-commands
   '(("c" todo "DONE|DEFERRED|CANCELLED" nil)
	 ("w" todo "WAITING" nil)
	 ("W" agenda "" ((org-agenda-ndays 21)))
 	 ("A" agenda ""
	  ((org-agenda-skip-function
		(lambda ()
		  (org-agenda-skip-entry-if 'noteregexp "\\=.*\\[#A\\]")))
	   (org-agenda-ndays 1)
	   (org-agenda-overriding-header "Today's Priority #A tasks: ")))
 	 ("u" alltodo ""
	  ((org-agenda-skip-function
		(lambda ()
		  (org-agenda-skip-entry-if 'scheduled 'deadline 'regexp "\n]+>")))
	   (org-agenda-overriding-header "Unscheduled TODO entries: ")))))

 '(org-remember-store-without-prompt t)
 '(remember-annotation-functions (quote (org-remember-annotation)))

 '(remember-handler-functions (quote (org-remember-handler))))


#+end_src

#+begin_src emacs-lisp :tangle beyeran/beyeran-gtd.el
(provide 'beyeran-gtd)
#+end_src
** Org Babel
#+begin_src emacs-lisp :tangle beyeran/beyeran-org-babel.el
;;
;; file: beyeran-org-babel.el
;;

;;; org babel ;;;
(require 'ob)
(require 'ob-eval)
(require 'ob-lisp)
(require 'ob-ruby)
(require 'ob-R)
(require 'ob-maxima)

(setq org-src-fontify-natevely t
      org-confirm-babel-evaluate nil)

(org-babel-do-load-languages
 'org-babel-load-languages 
 '((emacs-lisp . t)
   (dot . t)
   (lisp . t)
   (octave .t)
   (ditaa . t)
   (R . t)
   (python . t)
   (ruby . t)
   (maxima . t)
   (gnuplot . t)
   (clojure . t)
   (sh . t)))
#+end_src

#+begin_src emacs-lisp :tangle beyeran/beyeran-org-babel.el
(provide 'beyeran-org-babel)
#+end_src

** Org Mode Export Templates
*** Koma
#+begin_src emacs-lisp :tangle beyeran/beyeran-org-export-templates.el
;; #+LaTeX_CLASS: beamer
(unless (boundp 'org-export-latex-classes)
 (setq org-export-latex-classes nil))

(add-to-list 'org-export-latex-classes
             '("koma"
               "\\documentclass[a4paper,12pt]{scrartcl}"
               ("\\section{%s}" . "\\section{%s}")
               ("\\subsection{%s}" . "\\subsection{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection{%s}")
               ("\\paragraph{%s}" . "\\paragraph{%s}")
               ("\\subparagraph{%s}" . "\\subparagraph{%s}")))
#+end_src
*** Beamer
#+begin_src emacs-lisp :tangle beyeran/beyeran-org-export-templates.el
;; Beamer
;; #+LaTeX_CLASS: beamer in org files
(add-to-list 'org-export-latex-classes
             ;; beamer class, for presentations
             '("beamer"
               "\\documentclass[10pt]{beamer}\n
                \\mode<{{{beamermode}}}>\n
      \\usetheme{{{{beamertheme}}}}\n
      \\usecolortheme{{{{beamercolortheme}}}}\n
      \\beamertemplateballitem\n
      \\setbeameroption{show notes}
      \\usepackage[utf8]{inputenc}\n
      \\usepackage{hyperref}\n
      \\usepackage{color}
      \\usepackage{listings}
      \\lstset{numbers=none,language=[ISO]C++,tabsize=4,
  frame=single,
  basicstyle=\\small,
  showspaces=false,showstringspaces=false,
  showtabs=false,
  keywordstyle=\\color{blue}\\bfseries,
  commentstyle=\\color{red},
  }\n
      \\usepackage{verbatim}\n
      \\institute{{{{beamerinstitute}}}}\n          
       \\subject{{{{beamersubject}}}}\n"
               
               ("\\section{%s}" . "\\section*{%s}")
               
               ("\\begin{frame}[fragile]\\frametitle{%s}"
                "\\end{frame}"
                "\\begin{frame}[fragile]\\frametitle{%s}"
                "\\end{frame}")))
#+end_src
#+begin_src emacs-lisp :tangle beyeran/beyeran-org-export-templates.el
(provide 'beyeran-org-export-templates)
#+end_src

** Zettelkasten
#+begin_src emacs-lisp :tangle beyeran/beyeran-zettel.el
;;
;; file: beyeran-zettel.el
;;

#+end_src

Within these section I'm trying to implement something like a electronic 
version of Luhmann's "Zettelkasten". This apparatus is an approach to order
and structure notes. I'm trying to improve my workflow while writing term papers.

The idea is the following: If you read something and see information which you
think you could use later you note them with a reference to the source you read it.
This certain note (I suggest not to cite it but to paraphrase it) should be stored
with keywords fitting to the topic.

Now while writing I make a rough sketch of the content and then search the note file
for the keywords I want to write about. Now I've got all captured notes fitting to
the content I want to write. This method has additionally an advanate in linking
different topics together, depending on my style of tagging notes with keywords.

For example, I've read something about semiotics within a system theoretical
approach. I write a note about it. In my termpapter there should be a chapter on
systems theory, so I search my note file for the keyword "systems theory". There
I find my note to semiotics, as well as note I've read about a while ago on
thermodynamics and entropy. Through this collection I was able to link the semiotic
idea of information with the idea of information within thermodynamic entropy.


The workflow could be generalized like this:
  1. Capture a note
     - paraphrase what you've read
     - add the bibliographic information (bibtex prefered)
     - tagg the note with keywords
  2. Save the note
     The not should be stored at a global spot
  3. Search the note file by a given keyword


The basic usage makes use of org mode capure templates and reftext. At after
invoking a certain key combination at first you are asked on the headline
for the note, than you could choose from a certain reftex file for the
bibliographic information, then you are asked on the page number. After that
you are asked on the keywords (a point which is to be improved, this should be
asked afterwards). After that you are in the buffer which should let you
write and store the note.

#+begin_src emacs-lisp :tangle beyeran/beyeran-zettel.el
;; general variables
(require 'remember)

(org-remember-insinuate)

(defvar *note-file* "notes.org")
(defvar *note-directory* "~/documents/org/")
(defvar *bibliographic-file* "zettel.bib")

(setq org-directory *note-directory*
	  org-default-note-file (concat org-directory *note-file*)
	  org-agenda-include-diary t
	  org-use-fast-todo-selection t)

;; getting bibliographic information
(defun org-mode-reftex-setup ()
  (load-library "reftex")
  (and (buffer-file-name) (file-exists-p (buffer-file-name))
       (progn
		 ;; enable auto-revert-mode to update reftex when bibtex file changes on disk
		 (global-auto-revert-mode t)
		 (reftex-parse-all)
		 ;; add a custom reftex cite format to insert links
		 (reftex-set-cite-format '((?\C-m "\[cite][%l]"))))))

  (define-key org-mode-map (kbd "C-c )") 'reftex-citation)
  (define-key org-mode-map (kbd "C-c (") 'org-mode-reftex-search)

(defun org-mode-reftex-search ()
  ;;jump to the notes for the paper pointed to at from reftex search
  (interactive)
  (org-open-link-from-string (format "[[%s]]" (reftex-citation t))))

(setq reftex-default-bibliography (list (format "%s%s" 
												*note-directory*
												*bibliographic-file*)))

(setq org-link-abbrev-alist
      '(("bib" . (format "%s%s" *bibliographic-file* "::%s"))))

(setq org-capture-templates '(("z" "Zettel" entry (file org-default-note-file)
							   "* %^{title} \t %^g \n  :CITATION: %(reftex-citation) \n  :PAGE: %^{page}\n\n  %?")))

(add-hook 'org-mode-hook 'org-mode-reftex-setup)

(multiple-global-set-key (("\C-cr" org-capture)))

(provide 'beyeran-zettel)
#+end_src

* Statistics
#+begin_src emacs-lisp :tangle beyeran/beyeran-ess.el
;;
;; file: beyeran-ess.el
;;

(require 'ess-site)

(provide 'beyeran-ess)
#+end_src
* Programming Languages
** Haskell 
#+begin_src emacs-lisp :tangle beyeran/beyeran-haskell-mode.el
(add-to-list 'auto-mode-alist '("\\.hs$" . haskell-mode))

;;;; Variables ;;;;
(setq haskell-program-name "ghci"
      haskell-font-lock-symbols t
      haskell-hoogle-command "hoogle")

(defun custom-haskell-mode ()
  (haskell-indentation-mode -1)
  (haskell-indent-mode 1)
  (flyspell-prog-mode))

;;;; Hooks and Keys ;;;;
(multiple-add-to-hook haskell-mode-hook ('turn-on-haskell-doc-mode
                                         'turn-on-haskell-font-lock
                                         'turn-on-haskell-decl-scan
                                         'custom-haskell-mode
                                         'turn-on-haskell-simple-indent
                                         (lambda ()
                                           (define-keys haskell-mode-map
                                             '(("RET" newline)
                                               ("TAB" haskell-indent-cycle)
                                               ("C-c =" haskell-indent-insert-equal)
                                               ("C-c |" haskell-indent-insert-guard)
                                               ("C-c o" haskell-indent-insert-otherwise)
                                               ("C-c w" haskell-indent-insert-where)
                                               ("C-c ." haskell-indent-align-guards-and-rhs)
                                               ("C-c i" inferior-haskell-info))))))

(add-hook 'inferior-haskell-mode-hook
          (lambda ()
            (local-set-key (kbd "C-c h") 'haskell-hoogle)
            (turn-on-haskell-doc-mode 1)))


;;;; Requirements ;;;;
(require 'haskell-mode "haskell-mode" t)
(require 'inf-haskell "inf-haskell" t)
;;(require 'haskell-indent "haskell-indent" t)

(provide 'beyeran-haskell-mode)
#+end_src

